Public Member Functions | Public Attributes | List of all members
API_PropertyGroup Struct Reference
Property Manager
A structure representing a property group. More...
#include <APIdefs_Properties.h>
 Public Member Functions
API_PropertyGroup ()
 Public Attributes
API_PropertyGroupType  | groupType
The type of this property group.
API_Guid  | guid
The unique identifier of the property group.
GS::UniString  | name
The name of the property group.
GS::UniString  | description
The description of the property group.
Detailed Description
A structure representing a property group.
Constructor & Destructor Documentation
◆ API_PropertyGroup()
 API_PropertyGroup::API_PropertyGroup  |  ( |   | )
inline
Member Data Documentation
◆ description
 API_PropertyGroup::description
The description of the property group.
◆ groupType
 API_PropertyGroup::groupType
The type of this property group.
 API_PropertyGroupType  | Meaning
 API_PropertyStaticBuiltInGroupType  | All of the property definitions in this group are API_PropertyStaticBuiltInDefinitionType
 API_PropertyDynamicBuiltInGroupType  | All of the property definitions in this group are API_PropertyDynamicBuiltInDefinitionType
 API_PropertyCustomGroupType  | All of the property definitions in this group are API_PropertyCustomDefinitionType
◆ guid
 API_PropertyGroup::guid
The unique identifier of the property group.
◆ name
 API_PropertyGroup::name
The name of the property group.